In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\ashif\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ashif\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ashif\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ashif\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ashif\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\ashif\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [5]:
pd.__version__

'2.2.2'

In [11]:
s="hello"
f=pd.Series(s)
print(f)

0    hello
dtype: object

In [15]:
s1="welcome to kl university".split()
f1=pd.Series(s1)
print(f1)

0       welcome
1            to
2            kl
3    university
dtype: object

In [17]:
li=[1,2,3,4,"hello",20.56,True]
gh=pd.Series(li)
print(gh)

0        1
1        2
2        3
3        4
4    hello
5    20.56
6     True
dtype: object

In [21]:
li1=[3,"a",5.8]
fg=pd.Series(li1,index=["int","string","float"])
print(fg)

int         3
string      a
float     5.8
dtype: object

In [29]:
li2=[1,2,3,4,5,6]
ui=pd.Series(li2,index=['v1','v2','v3','v4','v5','v6'])
print(ui)

v1    1
v2    2
v3    3
v4    4
v5    5
v6    6
dtype: int64

In [25]:
u=(4,5,6,1,2,3)
jk=pd.Series(u)
print(jk)

0    4
1    5
2    6
3    1
4    2
5    3
dtype: int64

In [31]:
sd=pd.Series(['abc','bca','cds'],index=['a','b','c'])
print(sd)

a    abc
b    bca
c    cds
dtype: object

In [89]:
import numpy as np
n=np.array(range(1,101,2))
ji=pd.Series(n)
print(ji)

0      1
1      3
2      5
3      7
4      9
5     11
6     13
7     15
8     17
9     19
10    21
11    23
12    25
13    27
14    29
15    31
16    33
17    35
18    37
19    39
20    41
21    43
22    45
23    47
24    49
25    51
26    53
27    55
28    57
29    59
30    61
31    63
32    65
33    67
34    69
35    71
36    73
37    75
38    77
39    79
40    81
41    83
42    85
43    87
44    89
45    91
46    93
47    95
48    97
49    99
dtype: int32

In [57]:
d={'as':123,'ads':125,'jki':569}
df=pd.Series(d)
print(df)

as     123
ads    125
jki    569
dtype: int64

In [45]:
j=[35,45,69,25,63,98]
io=pd.Series(j)
print(io)
ju=pd.Series(j,index=['a','b','c','d','e','f'])
print(ju)

0    35
1    45
2    69
3    25
4    63
5    98
dtype: int64
a    35
b    45
c    69
d    25
e    63
f    98
dtype: int64

In [49]:
ju['a']

35

In [53]:
print(ju[:'c'])

a    35
b    45
c    69
dtype: int64

In [55]:
print(ju['c':'e'])

c    69
d    25
e    63
dtype: int64

In [59]:
print(df)

as     123
ads    125
jki    569
dtype: int64

In [61]:
print(df['jki'])

569

In [65]:
print(df['ads'])

125

In [67]:
print(ju)

a    35
b    45
c    69
d    25
e    63
f    98
dtype: int64

In [69]:
ju['a']=456
print(ju)

a    456
b     45
c     69
d     25
e     63
f     98
dtype: int64

In [71]:
ju['c']=459
print(ju)

a    456
b     45
c    459
d     25
e     63
f     98
dtype: int64

In [83]:
print(ju['a':'e':3])

a    456
d     25
dtype: int64

In [85]:
ju=ju.replace(456,67)
print(ju)

a     67
b     45
c    459
d     25
e     63
f     98
dtype: int64

In [103]:
ju=ju.replace(['a','b','c'],[78,85,63])
print(ju)

a    25
b    36
c    89
d    25
e    63
f    98
dtype: int64

In [93]:
ju=ju.replace([67,45,459],[25,36,89])
print(ju)

a    25
b    36
c    89
d    25
e    63
f    98
dtype: int64

In [105]:
ju=ju.drop(['b','a'])
print(ju)

c    89
d    25
e    63
f    98
dtype: int64

In [107]:
li=pd.Series('data analytics',index=[0,1,2,3,4,5,6,7,8,9,10])
print(li)

0     data analytics
1     data analytics
2     data analytics
3     data analytics
4     data analytics
5     data analytics
6     data analytics
7     data analytics
8     data analytics
9     data analytics
10    data analytics
dtype: object

In [121]:
g=np.array(range(0,21))
h=pd.Series(g**2)
print(h)

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
11    121
12    144
13    169
14    196
15    225
16    256
17    289
18    324
19    361
20    400
dtype: int32

In [115]:
print(h[::-1])

3    9
2    4
1    1
0    0
dtype: int64

In [128]:
PANDAS DATA FRAMES

SyntaxError: invalid syntax (1486271544.py, line 1)

In [130]:
    import pandas as pd

In [144]:
s = "hello good after noon".split()
pd.DataFrame(s)

       0
0  hello
1   good
2  after
3   noon

In [148]:
li=[[12,25,63],[12,25,63]]
pd.DataFrame(li)

    0   1   2
0  12  25  63
1  12  25  63

In [150]:
li=[[12,25,63],[12,25,63]]
pd.DataFrame(li,index=['list1','list2'])

        0   1   2
list1  12  25  63
list2  12  25  63

In [152]:
d={'key1':'h1','key2':'h2','key3':'h3'}
df=pd.DataFrame(d,index=[1,2,3,4])
df

  key1 key2 key3
1   h1   h2   h3
2   h1   h2   h3
3   h1   h2   h3
4   h1   h2   h3

In [156]:
d={'name':['raju','rajesh','ramu','ravi'],'rollno':[10,11,22,36],'branch':['mca','mba','bba','bca']}
df=pd.DataFrame(d,index=['person1','person2','person3','person4'])
df

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba
person4    ravi      36    bca

In [162]:
import numpy as np
import pandas as pd

k=np.array([[23,56,45,23],[22,25,26,30]])
h=pd.DataFrame(k,index=['number1','number2'])
h

          0   1   2   3
number1  23  56  45  23
number2  22  25  26  30

In [164]:
df

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba
person4    ravi      36    bca

In [166]:
df.columns

Index(['name', 'rollno', 'branch'], dtype='object')

In [168]:
df.values

array([['raju', 10, 'mca'],
       ['rajesh', 11, 'mba'],
       ['ramu', 22, 'bba'],
       ['ravi', 36, 'bca']], dtype=object)

In [170]:
print(len(df.values))

4

In [172]:
df.index

Index(['person1', 'person2', 'person3', 'person4'], dtype='object')

In [174]:
df.shape

(4, 3)

In [176]:
df['name']

person1      raju
person2    rajesh
person3      ramu
person4      ravi
Name: name, dtype: object

In [178]:
df['rollno']

person1    10
person2    11
person3    22
person4    36
Name: rollno, dtype: int64

In [180]:
df['branch']

person1    mca
person2    mba
person3    bba
person4    bca
Name: branch, dtype: object

In [188]:
df[['rollno','branch']]

         rollno branch
person1      10    mca
person2      11    mba
person3      22    bba
person4      36    bca

In [190]:
df.head(5)

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba
person4    ravi      36    bca

In [192]:
df.head()

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba
person4    ravi      36    bca

In [194]:
df.head(1)

         name  rollno branch
person1  raju      10    mca

In [196]:
df.head(3)

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba

In [198]:
df.tail()

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba
person4    ravi      36    bca

In [200]:
df.tail(2)

         name  rollno branch
person3  ramu      22    bba
person4  ravi      36    bca

In [202]:
df.tail(1)

         name  rollno branch
person4  ravi      36    bca

In [208]:
df.loc['person5']=['pavani',256,'cse']
df

           name  rollno branch
person1    raju      10    mca
person2  rajesh      11    mba
person3    ramu      22    bba
person4    ravi      36    bca
4        pavani     256    cse
person5  pavani     256    cse

In [214]:
df['marks']=[100,98,98,97,85,58]
df

           name  rollno branch  marks
person1    raju      10    mca    100
person2  rajesh      11    mba     98
person3    ramu      22    bba     98
person4    ravi      36    bca     97
4        pavani     256    cse     85
person5  pavani     256    cse     58

In [222]:
df.loc['person2','branch']='arts'
df

           name  rollno branch  marks
person1    raju    10.0    mca  100.0
person2  rajesh    11.0   arts   98.0
person3    ramu    22.0    bba   98.0
person4    ravi    36.0    bca   97.0
4        pavani   256.0    cse   85.0
person5  pavani   256.0    cse   58.0
2           NaN     NaN   arts    NaN

In [226]:
df.loc['person3']

name      ramu
rollno    22.0
branch     bba
marks     98.0
Name: person3, dtype: object

In [228]:
print(df)

           name  rollno branch  marks
person1    raju    10.0    mca  100.0
person2  rajesh    11.0   arts   98.0
person3    ramu    22.0    bba   98.0
person4    ravi    36.0    bca   97.0
4        pavani   256.0    cse   85.0
person5  pavani   256.0    cse   58.0
2           NaN     NaN   arts    NaN

In [240]:
df=df.drop(,axis=0)
df

KeyError: '[6] not found in axis'

In [238]:
df=df.drop(5,axis=0)
df

KeyError: '[5] not found in axis'

In [244]:
df=df.drop(5,axis=0)
df

KeyError: '[5] not found in axis'

In [248]:
df=df.drop('marks',axis=1)
df

           name  rollno branch
person1    raju    10.0    mca
person2  rajesh    11.0   arts
person3    ramu    22.0    bba
person4    ravi    36.0    bca
person5  pavani   256.0    cse
2           NaN     NaN   arts

In [250]:
df.rename(columns={'name':'NAME'}.INPLACE=True)
df

SyntaxError: invalid syntax (819901678.py, line 1)

In [7]:
import pandas as pd
df={'emp':['emp1','emp2','emp3'],'year':[2010,2020,2024]}
jk=pd.DataFrame(df,index=[1,2,3])
jk

    emp  year
1  emp1  2010
2  emp2  2020
3  emp3  2024

In [9]:
import pandas as pd
df1={'emp':['emp1','emp2','emp4'],'dept':['hr','operations','finance']}
ki=pd.DataFrame(df1,index=[1,2,3])
ki

    emp        dept
1  emp1          hr
2  emp2  operations
3  emp4     finance

In [13]:
pd.concat((jk,ki))

    emp    year        dept
1  emp1  2010.0         NaN
2  emp2  2020.0         NaN
3  emp3  2024.0         NaN
1  emp1     NaN          hr
2  emp2     NaN  operations
3  emp4     NaN     finance

In [15]:
pd.merge(jk,ki)

    emp  year        dept
0  emp1  2010          hr
1  emp2  2020  operations

In [71]:
er=pd.read_csv ('C:\Users\ASHIF\Downloads\employe,csv')
er

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (3662912296.py, line 1)

In [57]:
emp=pd.read_csv('C:\\Users\\ASHIF\\Desktop\\DATA ANALYSIS\\employe.csv')
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,08-06-93,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,03-04-05,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [59]:
emp['Gender'].fillna(0)

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995         0
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [61]:
emp.isnull()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,True,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [63]:
emp['Gender'].fillna("no gender")

0           Male
1           Male
2         Female
3           Male
4           Male
         ...
995    no gender
996         Male
997         Male
998         Male
999         Male
Name: Gender, Length: 1000, dtype: object

In [65]:
emp['Gender'].fillna(0)

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995         0
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [67]:
emp.loc[995,'Gender']

nan

In [75]:
emp.loc[1,'Team']

nan

In [77]:
emp["Team"].fillna("nothinh")

0                 Marketing
1                   nothinh
2                   Finance
3                   Finance
4           Client Services
               ...
995            Distribution
996                 Finance
997                 Product
998    Business Development
999                   Sales
Name: Team, Length: 1000, dtype: object

In [83]:
emp.replace(to_replace='Male',value='MALE')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,MALE,08-06-93,12:42 PM,97308,6.945,True,Marketing
1,Thomas,MALE,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,MALE,03-04-05,1:00 PM,138705,9.340,True,Finance
4,Larry,MALE,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,MALE,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,MALE,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,MALE,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,MALE,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [89]:
emp.drop_duplicates()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,08-06-93,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,03-04-05,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [93]:
emp.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

df=pd.read_csv('C:\Users\ASHIF\Desktop\DATA ANALYSIS')

In [97]:
df=pd.read_csv('C:\\Users\\ASHIF\\Desktop\\DATA ANALYSIS\\salary_data.csv')
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [99]:
df.head(5)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [101]:
df.tail(5)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [121]:
df['Salary'].max()

250000.0

y

NameError: name 'salary' is not defined

In [111]:
df=salary.max()
df

NameError: name 'salary' is not defined

In [117]:
df.loc[6699,'salary']

KeyError: 'salary'

In [119]:
emp.loc[995,'Gender']

nan